import React from "react";

function BuyerRules() {
  return (
    <div className=" font-PeydaRegular text-center">
      <h1>مطابق با مواد ۴۹۰ و ۵۳۲ قانون مدنی </h1>
      <h1>
        تعهدات اجاره‌گیرنده: - پرداخت به‌موقع **اجاره‌بها** مطابق قرارداد. -
        جبران خسارت در صورت **تلف یا آسیب به کالا** (مگر در موارد قهری مثل سیل و
        آتش‌سوزی).
      </h1>
      <h1>
        محدودیت‌ها: - ممنوعیت **تحویل کالا به شخص ثالث** بدون اطلاع اجاره‌دهنده.
        - استفاده از کالا **تنها برای هدف ذکرشده در قرارداد**.
      </h1>
      <h1>
        ضمانت اجرا: - در صورت عدم بازگرداندن کالا، اجاره‌دهنده می‌تواند **به
        مراجع قضایی شکایت کند**.
      </h1>
      <h1>
        وضعیت پلتفرم: - این سامانه صرفاً یک **فضای واسطه** است و هیچ مسئولیتی در
        قبال: - صحت اطلاعات کاربران - کیفیت کالاهای اجاره‌ای - اختلافات مالی یا
        حقوقی بین کاربران ندارد.{" "}
      </h1>
      <h1>
        تعهدات کاربران: - ارائه اطلاعات هویتی **واقعی** (مطابق با قوانین جمهوری
        اسلامی ایران). - اجاره‌دهنده موظف است کالا را در وضعیت **قابل استفاده**
        تحویل دهد. - اجاره‌گیرنده متعهد می‌شود کالا را مطابق با **شرایط ذکرشده
        در قرارداد** استفاده کند.{" "}
      </h1>
      <h1>
        مسئولیت‌های مالی: - هرگونه ضرر ناشی از **تخلف یا بی‌احتیاطی** بر عهده
        کاربر متخلف است. - در صورت اختلاف، کاربران موظفند **داوری از طریق مراجع
        قضایی ایران** را بپذیرند.{" "}
      </h1>
    </div>
  );
}

export default BuyerRules;
