import React from "react";

function SellerRules() {
  return (
    <div className=" font-PeydaRegular text-center">
      <h1>مطابق با مواد ۴۸۹ تا ۵۴۸ قانون مدنی ایران</h1>
      <h1>
        تعهدات اجاره‌دهنده: - تحویل کالا در زمان مقرر با **شرایط فنی ذکرشده در
        آگهی**. - مسئولیت پرداخت **مالیات اجاره** (در صورت شمول) بر عهده
        اجاره‌دهنده است.{" "}
      </h1>
      <h1>
        اختیارات پلتفرم: - در صورت تخلف کاربر (مثل تحویل کالای معیوب)، پلتفرم حق
        **حذف حساب کاربری** را دارد.
      </h1>
      <h1>
        قوانین شرعی: - اجاره‌دهنده موظف است از **اجاره دادن کالاهای حرام** (مثل
        مشروبات الکلی) خودداری کند.{" "}
      </h1>
      <h1>
        وضعیت پلتفرم: - این سامانه صرفاً یک **فضای واسطه** است و هیچ مسئولیتی در
        قبال: - صحت اطلاعات کاربران - کیفیت کالاهای اجاره‌ای - اختلافات مالی یا
        حقوقی بین کاربران ندارد.{" "}
      </h1>
      <h1>
        تعهدات کاربران: - ارائه اطلاعات هویتی **واقعی** (مطابق با قوانین جمهوری
        اسلامی ایران). - اجاره‌دهنده موظف است کالا را در وضعیت **قابل استفاده**
        تحویل دهد. - اجاره‌گیرنده متعهد می‌شود کالا را مطابق با **شرایط ذکرشده
        در قرارداد** استفاده کند.{" "}
      </h1>
      <h1>
        مسئولیت‌های مالی: - هرگونه ضرر ناشی از **تخلف یا بی‌احتیاطی** بر عهده
        کاربر متخلف است. - در صورت اختلاف، کاربران موظفند **داوری از طریق مراجع
        قضایی ایران** را بپذیرند.{" "}
      </h1>
    </div>
  );
}

export default SellerRules;
